podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SWM_LPC82x.svd.xml
            <register>
               <name>PINASSIGN11</name>
               <description>Pin assign register 11. Assign movable functions ADC_PINTRIG1, ACMP_O, CLKOUT, GPIO_INT_BMAT</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>ADC_PINTRIG1_I</name>
                     <description>ADC_PINTRIG1 function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_28 (= 0x1C)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACMP_O_O</name>
                     <description>ACMP_O function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_28 (= 0x1C)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLKOUT_O</name>
                     <description>CLKOUT function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_28 (= 0x1C)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO_INT_BMAT_O</name>
                     <description>GPIO_INT_BMAT function assignment. The value is the pin number to be assigned to this function. The following pins are available: PIO0_0 (= 0) to PIO0_28 (= 0x1C)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PINENABLE0</name>
               <description>Pin enable register 0. Enables fixed-pin functions ACMP_I0, ACMP_I1, SWCLK, SWDIO, XTALIN, XTALOUT, RESET, CLKIN, VDDCMP</description>
               <addressOffset>0x1C0</addressOffset>
               <resetValue>0xFFFFFECF</resetValue>
               <fields>
                  <field>
                     <name>ACMP_I1</name>
                     <description>ACMP_I1  function select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ACMP_I1_ENABLED_ON_P</name>
                           <description>ACMP_I1 enabled on pin PIO0_00</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_I1_DISABLED</name>
                           <description>ACMP_I1 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMP_I2</name>
                     <description>ACMP_I2  function select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ACMP_I2_ENABLED_ON_P</name>
                           <description>ACMP_I2 enabled on pin PIO0_1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_I2_DISABLED</name>
                           <description>ACMP_I2 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMP_I3</name>
                     <description>ACMP_I3  function select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ACMP_I3_ENABLED_ON_P</name>
                           <description>ACMP_I3 enabled on pin PIO0_14</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_I3_DISABLED</name>
                           <description>ACMP_I3 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMP_I4</name>
                     <description>ACMP_I4  function select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ACMP_I4_ENABLED_ON_P</name>
                           <description>ACMP_I4 enabled on pin PIO0_23</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACMP_I4_DISABLED</name>
                           <description>ACMP_I4 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWCLK</name>
                     <description>SWCLK  function select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SWCLK_ENABLED_ON_PIN</name>
                           <description>SWCLK enabled on pin PIO0_3</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWCLK_DISABLED</name>
                           <description>SWCLK disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWDIO</name>
                     <description>SWDIO  function select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SWDIO_ENABLED_ON_PIN</name>
                           <description>SWDIO enabled on pin PIO0_2</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWDIO_DISABLED</name>
                           <description>SWDIO disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XTALIN</name>
                     <description>XTALIN  function select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>XTALIN_ENABLED_ON_PI</name>
                           <description>XTALIN enabled on pin PIO0_8</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTALIN_DISABLED</name>
                           <description>XTALIN disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XTALOUT</name>
                     <description>XTALOUT  function select</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>XTALOUT_ENABLED_ON_P</name>
                           <description>XTALOUT enabled on pin PIO0_9</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTALOUT_DISABLED</name>
                           <description>XTALOUT disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESETN</name>
                     <description>RESETN  function select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RESETN_ENABLED_ON_PI</name>
                           <description>RESETN enabled on pin PIO0_5</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESETN_DISABLED</name>
                           <description>RESETN disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKIN</name>
                     <description>CLKIN  function select</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CLKIN_ENABLED_ON_PIN</name>
                           <description>CLKIN enabled on pin PIO0_1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLKIN_DISABLED</name>
                           <description>CLKIN disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VDDCMP</name>
                     <description>VDDCMP  function select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>VDDCMP_ENABLED_ON_PI</name>
                           <description>VDDCMP enabled on pin PIO0_6</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDDCMP_DISABLED</name>
                           <description>VDDCMP disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C0_SDA</name>
                     <description>I2C0_SDA  function select</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>I2C0_SDA_ENABLED_ON</name>
                           <description>I2C0_SDA enabled on pin PIO0_11</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C0_SDA_DISABLED</name>
                           <description>I2C0_SDA disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2C0_SCL</name>
                     <description>I2C0_SCL  function select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>I2C0_SCL_ENABLED_ON</name>
                           <description>I2C0_SCL enabled on pin PIO0_10</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2C0_SCL_DISABLED</name>
                           <description>I2C0_SCL disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_0</name>
                     <description>ADC_0  function select</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_0_ENABLED_ON_PIN</name>
                           <description>ADC_0 enabled on pin PIO0_7</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_0_DISABLED</name>
                           <description>ADC_0 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_1</name>
                     <description>ADC_1  function select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_1_ENABLED_ON_PIN</name>
                           <description>ADC_1 enabled on pin PIO0_6</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_1_DISABLED</name>
                           <description>ADC_1 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_2</name>
                     <description>ADC_2  function select</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_2_ENABLED_ON_PIN</name>
                           <description>ADC_2 enabled on pin PIO0_14</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_2_DISABLED</name>
                           <description>ADC_2 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_3</name>
                     <description>ADC_3  function select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_3_ENABLED_ON_PIN</name>
                           <description>ADC_3 enabled on pin PIO0_23</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_3_DISABLED</name>
                           <description>ADC_3 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_4</name>
                     <description>ADC_4  function select</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_4_ENABLED_ON_PIN</name>
                           <description>ADC_4 enabled on pin PIO0_22</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_4_DISABLED</name>
                           <description>ADC_4 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_5</name>
                     <description>ADC_5  function select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_5_ENABLED_ON_PIN</name>
                           <description>ADC_5 enabled on pin PIO0_21</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_5_DISABLED</name>
                           <description>ADC_5 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_6</name>
                     <description>ADC_6  function select</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_6_ENABLED_ON_PIN</name>
                           <description>ADC_6 enabled on pin PIO0_20</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_6_DISABLED</name>
                           <description>ADC_6 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_7</name>
                     <description>ADC_7  function select</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_7_ENABLED_ON_PIN</name>
                           <description>ADC_7 enabled on pin PIO0_19</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_7_DISABLED</name>
                           <description>ADC_7 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_8</name>
                     <description>ADC_8  function select</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_8_ENABLED_ON_PIN</name>
                           <description>ADC_8 enabled on pin PIO0_18</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_8_DISABLED</name>
                           <description>ADC_8 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_9</name>
                     <description>ADC_9  function select</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_9_ENABLED_ON_PIN</name>
                           <description>ADC_9 enabled on pin PIO0_17</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_9_DISABLED</name>
                           <description>ADC_9 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_10</name>
                     <description>ADC_10  function select</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_10_ENABLED_ON_PI</name>
                           <description>ADC_10 enabled on pin PIO0_13</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_10_DISABLED</name>
                           <description>ADC_10 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_11</name>
                     <description>ADC_11  function select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ADC_11_ENABLED_ON_PI</name>
                           <description>ADC_11 enabled on pin PIO0_4</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_11_DISABLED</name>
                           <description>ADC_11 disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
